# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ #
#                           How to install                           #
# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ #

# To install this, run:
# brew bundle --no-lock --file={{ .chezmoi.sourceDir }}/dot_config/Brewfile

# ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Taps ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ #
tap "homebrew/bundle"            # Bundler for Homebrew

## Personal
tap "gatlenculp/mopman"
tap "gatlenculp/vivaria"

## Custom package repositories
tap "charmbracelet/tap"          # Terminal tools and TUIs
tap "konradsz/igrep"             # Fast grep implementation
tap "mayowa-ojo/tap"             # Custom tools
tap "nat-n/poethepoet"           # Task runner for Python projects
tap "noborus/tap"                # Terminal tools
tap "ynqa/tap"                   # Development tools

## Testing Homebrew
tap "homebrew/test-bot"          # Testing tools for Homebrew

# ───────────────────────── Core Utilities ───────────────────────── #
## Compression
brew "xz"                        # Data compression tool
brew "gnu-tar"                   # GNU version of tar archiving utility

brew "go-task"                   # Task runner / simpler Make alternative
brew "awscli"                    # Amazon Web Services CLI

# ━━━━━━━━━━━━━━━━━━━━━━━━━━ Applications ━━━━━━━━━━━━━━━━━━━━━━━━━━ #

# ──────────────────────────── Browsers ──────────────────────────── #
cask "firefox"                   # Mozilla web browser
cask "google-chrome"             # Google's web browser
cask "tor-browser"               # Privacy-focused browser

# ────────────────────────────── Video ───────────────────────────── #
cask "adobe-creative-cloud"      # Creative suite from Adobe
cask "vlc"                       # Media player with wide format support
cask "blender"                   # 3D creation suite
cask "clipgrab"                  # Video downloader and converter
cask "obs"                       # Streaming and recording software
brew "vhs"                       # Terminal recorder and animator

# ───────────────────────────── Office ───────────────────────────── #
cask "microsoft-office"          # Microsoft Office suite
cask "microsoft-auto-update"     # Microsoft Office updater
cask "cold-turkey-blocker"       # Website and application blocker
cask "dropbox"                   # Cloud storage service
cask "lastpass"                  # Password manager
cask "notion"                    # Note-taking and collaboration platform
cask "notion-calendar"           # Calendar app from Notion
cask "zotero"                    # Reference management software
cask "flux"                      # Screen color temperature adjuster


# ────────────────────────────── Comms ───────────────────────────── #
cask "discord"                   # Voice and text chat platform
cask "messenger"                 # Facebook Messenger desktop client
cask "whatsapp"                  # WhatsApp desktop client
cask "zoom"                      # Video conferencing software
cask "signal"                    # Encrypted messaging app
cask "slack"                     # Team communication platform

# ────────────────────────────── Games ───────────────────────────── #
cask "epic-games"               # Epic Games Store client
cask "gog-galaxy"               # GOG gaming platform client
cask "steam"                    # Valve's gaming platform
cask "minecraft"                # Popular sandbox game

# ─────────────────────────── macOS Only ─────────────────────────── #
cask "alfred"                    # Productivity app for macOS
cask "cleanshot"                # Screenshot and recording tool
cask "pixelsnap"                # Measurement tool for designers
cask "rectangle-pro"            # Window management tool
brew "duti"                     # Tool to set default document and URL handlers
cask "mactex"                   # LaTeX distribution for macOS

## Quicklook
cask "apparency"                # QuickLook plugin for app inspection
# Quicklook but possibly doesn't work
cask "qlcolorcode"              # QuickLook plugin for code with syntax highlighting
cask "qlimagesize"              # QuickLook plugin for image size and resolution
cask "qlmarkdown"               # QuickLook plugin for Markdown files
cask "qlstephen"                # QuickLook plugin for plain text files without extension
cask "qlvideo"                  # QuickLook plugin for video files
cask "ipynb-quicklook"          # QuickLook plugin for Jupyter notebooks
cask "quicklook-json"           # QuickLook plugin for JSON files
cask "quicklookase"             # QuickLook plugin for Adobe ASE color swatches
cask "suspicious-package"        # QuickLook plugin for macOS installer packages

# ────────────────────────────── Misc ────────────────────────────── #
brew "gambit"                    # Scheme implementation

# ─────────────────────────── Containers ─────────────────────────── #
cask "orbstack"                  # Docker & Linux on macOS
# brew "docker-completion"
cask "kubernetes-cli"            # Command-line tool for Kubernetes

# ━━━━━━━━━━━━━━━━━━━━━━━━━━ Cybersecurity ━━━━━━━━━━━━━━━━━━━━━━━━━ #
## VPN
brew "openvpn"                   # Open source VPN solution
## Library
cask "metasploit"               # Penetration testing framework
## Network
cask "burp-suite"               # Web security testing tool
brew "wireshark"                # Network protocol analyzer
brew "aircrack-ng"              # Network security tool suite
## Hardware
cask "qflipper"                 # Flipper Zero firmware updater
## Passwords
brew "hydra"                    # Password cracking tool
brew "john"                     # John the Ripper password cracker
brew "fcrackzip"                # Zip password cracker
brew "knock"                    # Port knock sequence sender
brew "sqlmap"                   # SQL injection testing tool
brew "socat"                    # Multipurpose relay tool
brew "tcpflow"                  # TCP flow recorder
brew "tcpreplay"                # TCP packet replay tool
brew "tcptrace"                 # TCP connection analysis tool
brew "ucspi-tcp"                # TCP client-server program tools
brew "dns2tcp"                  # DNS tunneling tool


# ━━━━━━━━━━━━━━━━━━━━━━━━━━━ Development ━━━━━━━━━━━━━━━━━━━━━━━━━━ #

# ───────────────────────────── Python ───────────────────────────── #
## Package/Environment Management
brew "uv"                        # Fast Python package installer and resolver
# brew "poetry"
cask "miniconda"                 # Minimal Conda installer

brew "flit"                      # Simplified Python package publishing
brew "jupyterlab"                # Web-based notebook environment


## QA
brew "pylint"                    # Python code static checker
brew "pyright"                   # Static type checker for Python
brew "ruff"                      # Fast Python linter and code formatter
# brew "pipx"

## Templating
brew "cookiecutter"              # Project template tool
brew "cruft"                     # Project template manager
brew "nat-n/poethepoet/poethepoet" # Task runner for Python projects

# ────────────────────────────── Langs ───────────────────────────── #
cask "sage"                      # Mathematics software system
## PHP
brew "php"                       # General-purpose scripting language
## JavaScript
brew "node"                      # JavaScript runtime environment
brew "biome"                     # Toolchain for web projects
## Ruby
brew "ruby"                      # Dynamic, object-oriented programming language
## Rust
brew "rust"                      # Systems programming language
## LISP
cask "racket"                    # Modern LISP and programming language platform
## PERL
brew "perl"                      # Highly capable scripting language
## GO
brew "go"                        # Open source programming language
## Markdown
brew "mdformat"                  # Markdown formatter
## LaTeX
brew "tex-fmt"                   # TeX document formatting system
brew "latexindent"              # Perl script for formatting LaTeX files
brew "pandoc"                    # Universal document converter
## TOML
brew "taplo"                     # TOML toolkit and parser
## Misc
brew "prettier"                  # Code formatter for multiple languages
cask "dotnet-sdk"               # SDK for Microsoft's .NET platform
brew "typescript"                # Typed superset of JavaScript

# ──────────────────────────── Databases ─────────────────────────── #
brew "postgresql@16"             # Object-relational database system

# ───────────────────────────── Editors ──────────────────────────── #
cask "visual-studio-code"        # Code editor from Microsoft
cask "cursor"                    # AI-powered code editor
brew "neovim"                    # Modernized Vim text editor

# ────────────────────────────── Fonts ───────────────────────────── #
cask "font-blackout"             # Sans-serif display font
cask "font-computer-modern"      # Computer Modern font family
cask "font-fira-code"            # Monospace font with programming ligatures
cask "font-fira-code-nerd-font" # Fira Code with added icons
cask "font-noto-naskh-arabic"   # Google Noto font for Arabic script
cask "font-noto-serif"          # Google Noto serif font family
cask "font-noto-serif-bengali"  # Google Noto font for Bengali script
cask "font-noto-serif-cjk"      # Google Noto font for CJK languages
cask "font-noto-serif-devanagari" # Google Noto font for Devanagari script
cask "font-noto-serif-hebrew"   # Google Noto font for Hebrew script
cask "font-noto-serif-thai"     # Google Noto font for Thai script
cask "font-nova-round"          # Rounded sans-serif font



# ──────────────────────────── Terminal ──────────────────────────── #
cask "iterm2"                    # Terminal emulator for macOS
cask "itermai"                   # AI-powered terminal
cask "warp"                      # Modern terminal with AI features

# ───────────────────────────── Shells ───────────────────────────── #
## ZSH
brew "zsh"                       # Z shell, a modern alternative to bash
brew "zsh-autosuggestions"       # Fish-like autosuggestions for zsh
brew "zsh-syntax-highlighting"   # Fish-like syntax highlighting for zsh

## BASH
brew "bash"                      # Bourne Again SHell
brew "bash-completion@2"         # Programmable completion for Bash

## Misc Shell
brew "xonsh"                     # Python-powered shell language
brew "nushell"                   # Modern shell written in Rust
cask "powershell"               # Microsoft's task automation framework

## Shell Extensions

## Shell Linting
brew "shellcheck"                # Shell script analysis tool
brew "shfmt"                     # Shell script formatter

# ───────────────────────── Shell Commands ───────────────────────── #
brew "eza"                       # Modern replacement for ls
brew "oh-my-posh"               # Prompt theme engine
brew "fastfetch"                # System information tool
brew "bat"                       # Cat clone with syntax highlighting

brew "yo", link: false          # Scaffolding tool for web apps

brew "zoxide"                    # Smarter cd command
brew "btop"                      # System monitor
brew "fzf"                       # Fuzzy finder

brew "clipboard"                 # Command line clipboard tool
brew "grep"                      # GNU grep
brew "konradsz/igrep/igrep"     # Interactive grep tool
brew "mayowa-ojo/tap/chmod-cli"  # chmod permission manager
brew "screen"                    # Terminal multiplexer
brew "sshs"                      # SSH connection manager
brew "syncthing"                 # File synchronization tool
brew "charmbracelet/tap/freeze"  # Generate lock files for dependencies
brew "noborus/tap/ov"           # Terminal pager
brew "ynqa/tap/sigrs"           # Signal handler utility

## Terminal Multiplexer
brew "zellij"                   # Modern terminal multiplexer in Rust
brew "tmux"                     # Terminal session manager
brew "rich"                     # Rich text and styling for terminal output

brew "thefuck"                  # Command correction tool
brew "tldr"                     # Simplified man pages
brew "tre-command"              # Tree command with git integration


# ─────────────────────────────── Git ────────────────────────────── #
## Git + Extensions
brew "git"                      # Version control system
brew "git-filter-repo"          # History rewriting tool
cask "git-credential-manager"   # Secure Git credential storage
brew "git-lfs"                  # Git extension for large files

## Git Tools
cask "gitkraken"               # Git GUI client
brew "bfg"                      # Git repository cleaner

## Git QA
brew "commitizen"              # Standardized commit message tool
brew "czg"                     # Interactive commitizen CLI
brew "gitleaks"               # Secret scanning tool
## brew "trufflehog"
brew "pre-commit"             # Git hooks manager
brew "check-jsonschema"       # JSON Schema validation tool

## Github
brew "gh"                     # GitHub CLI tool
brew "act"                    # Run GitHub Actions locally
brew "actionlint"             # GitHub Actions workflow linter

# ───────────────────────────── Remote ───────────────────────────── #
cask "postico"                # PostgreSQL client for macOS
cask "postman"               # API development environment
brew "openssh"               # OpenSSH remote login client
cask "ngrok"                 # Reverse proxy for sharing localhost

# ─────────────────────────────── AI ─────────────────────────────── #
cask "claude"                    # Anthropic's AI assistant
cask "netron"                    # Neural network viewer

cask "spotify"                   # Music streaming service

# ─────────────────── Random stuff I may not need ────────────────── #

## Core Libraries
# brew "abseil"                    # C++ library from Google
# brew "icu4c@76"                  # C/C++ and Java libraries for Unicode and globalization
# brew "gmp"                       # GNU Multiple Precision Arithmetic Library
# brew "binutils"                  # GNU binary tools
# brew "pkgconf"                   # Package compiler and linker metadata toolkit

## Likely cybersecurity
# brew "binwalk"                   # Firmware analysis tool
# brew "foremost"                  # File carving and recovery tool
# brew "pngcheck"                  # PNG file validator and debugger
# brew "cifer"                     # Automating cipher cracking

## Misc
# brew "re2"                       # Fast, safe alternative to backtracking regex engines
# brew "llvm"                      # LLVM compiler infrastructure
# brew "dex2jar"                   # Android DEX to Java decompiler
# brew "netpbm"                    # Graphics conversion tools
# brew "pdf2svg"                   # PDF to SVG converter


# ━━━━━━━━━━━━━━━━━━━━━━━━ VSCode Extensions ━━━━━━━━━━━━━━━━━━━━━━━ #
vscode "076923.python-image-preview"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.iconify"
vscode "aws-scripting-guy.cform"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "ckolkman.vscode-postgres"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "ctcuff.font-preview"
vscode "cvbenur.ducky-script-lang-vscode"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotenv.dotenv-vscode"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "formulahendry.docker-explorer"
vscode "gera2ld.markmap-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graykode.ai-docstring"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "hyeon.c-math-viewer"
vscode "hyperoot.settings-organizer"
vscode "ibm.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "ipedrazas.kubernetes-snippets"
vscode "james-yu.latex-workshop"
vscode "janne252.fontawesome-autocomplete"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "julialang.language-julia"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koehlma.markdown-math"
vscode "koichisasada.vscode-rdbg"
vscode "leodevbro.blockman"
vscode "liamhammett.inline-parameters"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "lmcarreiro.vscode-smart-column-indenter"
vscode "lov3.sagemath-enhanced"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "orangex4.latex-sympy-calculator"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "robocorp.robotframework-lsp"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "salbert.copy-text"
vscode "sbsnippets.pytorch-snippets"
vscode "seyyedkhandon.firacode"
vscode "shardulm94.trailing-spaces"
vscode "shinotatwu-ds.file-tree-generator"
vscode "shopify.ruby-lsp"
vscode "sirmspencer.vscode-autohide"
vscode "skacekachna.win-opacity"
vscode "sorbet.sorbet-vscode-extension"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "surv.typst-math"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tonybaloney.vscode-pets"
vscode "ttoowa.in-your-face-incredible"
vscode "twxs.cmake"
vscode "tyriar.luna-paint"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "xadillax.viml"
vscode "xqua.ducky-script-lang-vscode-flipper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
