# ---------------------------------------------------------------------------- #
#                                     Taps                                     #
# ---------------------------------------------------------------------------- #
tap "charmbracelet/tap"
tap "gatlenculp/mopman"
tap "gatlenculp/vivaria"
tap "homebrew/bundle"
tap "homebrew/test-bot"
tap "konradsz/igrep", "https://github.com/konradsz/igrep.git"
tap "mayowa-ojo/tap"
tap "nat-n/poethepoet"
tap "noborus/tap"
tap "ynqa/tap"

# ---------------------------------------------------------------------------- #
#                                   Formulas                                   #
# ---------------------------------------------------------------------------- #
brew "abseil"
brew "act"
brew "shellcheck"
brew "actionlint"
brew "aircrack-ng"
brew "xz"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "icu4c@76"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "biome"
brew "black"
brew "btop"
brew "check-jsonschema"
brew "cifer"
brew "clipboard"
brew "commitizen"
brew "cookiecutter"
brew "cruft"
brew "node"
brew "czg"
brew "dex2jar"
brew "dns2tcp"
brew "duti"
brew "eza"
brew "fastfetch"
brew "fcrackzip"
brew "gmp"
brew "flit"
brew "foremost"
brew "fzf"
brew "gambit"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gitleaks"
brew "gnu-tar"
brew "go"
brew "go-task"
brew "grep"
brew "hydra"
brew "john"
brew "pandoc"
brew "jupyterlab"
brew "knock"
brew "perl"
brew "latexindent"
brew "llvm"
brew "mdformat"
brew "neovim"
brew "netpbm"
brew "nmap"
brew "nushell"
brew "oh-my-posh"
brew "openssh"
brew "openvpn"
brew "pdf2svg"
brew "php"
brew "pipx"
brew "pkgconf"
brew "pngcheck"
brew "poetry"
brew "postgresql@16"
brew "pre-commit"
brew "prettier"
brew "pylint"
brew "pyright"
brew "python-tk@3.12"
brew "re2"
brew "ruby"
brew "ruff"
brew "rust"
brew "screen"
brew "shfmt"
brew "socat"
brew "sqlmap"
brew "sshs"
brew "syncthing"
brew "taplo"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "tex-fmt"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tre-command"
brew "trufflehog"
brew "typescript"
brew "ucspi-tcp"
brew "uv"
brew "vhs"
brew "wireshark"
brew "xonsh"
brew "yo", link: false
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/freeze"
brew "konradsz/igrep/igrep"
brew "mayowa-ojo/tap/chmod-cli"
brew "nat-n/poethepoet/poethepoet"
brew "noborus/tap/ov"
brew "ynqa/tap/sigrs"

# ---------------------------------------------------------------------------- #
#                                     Casks                                    #
# ---------------------------------------------------------------------------- #

cask "adobe-creative-cloud"
cask "alfred"
cask "apparency"
cask "arc"
cask "blender"
cask "burp-suite"
cask "claude"
cask "cleanshot"
cask "clipgrab"
cask "cold-turkey-blocker"
cask "cork"
cask "cursor"
cask "discord"
cask "dotnet-sdk"
cask "dropbox"
cask "epic-games"
cask "firefox"
cask "flux"
cask "font-blackout"
cask "font-computer-modern"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-noto-naskh-arabic"
cask "font-noto-serif"
cask "font-noto-serif-bengali"
cask "font-noto-serif-cjk"
cask "font-noto-serif-devanagari"
cask "font-noto-serif-hebrew"
cask "font-noto-serif-thai"
cask "font-nova-round"
cask "git-credential-manager"
cask "gitkraken"
cask "gog-galaxy"
cask "google-chrome"
cask "ipynb-quicklook"
cask "iterm2"
cask "itermai"
cask "lastpass"
cask "mactex"
cask "messenger"
cask "metasploit"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "minecraft"
cask "miniconda"
cask "netron"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "orbstack"
cask "pixelsnap"
cask "postico"
cask "postman"
cask "powershell"
cask "qflipper"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "racket"
cask "rectangle-pro"
cask "sage"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "zenmap"
cask "zoom"
cask "zotero"


# ---------------------------------------------------------------------------- #
#                      VSCode Extensions (Likely Outdated)                     #
# ---------------------------------------------------------------------------- #
vscode "076923.python-image-preview"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.iconify"
vscode "aws-scripting-guy.cform"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "cameron.vscode-pytest"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "ckolkman.vscode-postgres"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "ctcuff.font-preview"
vscode "cvbenur.ducky-script-lang-vscode"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotenv.dotenv-vscode"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "formulahendry.docker-explorer"
vscode "gera2ld.markmap-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graykode.ai-docstring"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "hyeon.c-math-viewer"
vscode "hyperoot.settings-organizer"
vscode "ibm.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "ipedrazas.kubernetes-snippets"
vscode "james-yu.latex-workshop"
vscode "janne252.fontawesome-autocomplete"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "julialang.language-julia"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koehlma.markdown-math"
vscode "koichisasada.vscode-rdbg"
vscode "leodevbro.blockman"
vscode "liamhammett.inline-parameters"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "lmcarreiro.vscode-smart-column-indenter"
vscode "lov3.sagemath-enhanced"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "orangex4.latex-sympy-calculator"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "robocorp.robotframework-lsp"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "salbert.copy-text"
vscode "sbsnippets.pytorch-snippets"
vscode "seyyedkhandon.firacode"
vscode "shardulm94.trailing-spaces"
vscode "shinotatwu-ds.file-tree-generator"
vscode "shopify.ruby-lsp"
vscode "sirmspencer.vscode-autohide"
vscode "skacekachna.win-opacity"
vscode "sorbet.sorbet-vscode-extension"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "surv.typst-math"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tonybaloney.vscode-pets"
vscode "ttoowa.in-your-face-incredible"
vscode "twxs.cmake"
vscode "tyriar.luna-paint"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "xadillax.viml"
vscode "xqua.ducky-script-lang-vscode-flipper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
